Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: On a project for which you're not the maintainer, it's generally easier to have a branch like `master` always track `origin/master` and to do your work in topic branches that you can easily discard if they're rejected.
cs: U projektů, kde nevystupujete jako správce, je většinou jednodušší, aby vaše větev `master` stále sledovala větev `origin/master` a abyste práci prováděli v tématických větvích, které můžete v případě odmítnutí snadno odstranit.

source: On a x86 system [source,console] ---- $ git config --global core.editor "'C:/Program Files/Notepad++/notepad++.exe' -multiInst -nosession" ---- On a x64 system [source,console] ---- $ git config --global core.editor "'C:/Program Files (x86)/Notepad++/notepad++.exe' -multiInst -nosession" ----
cs: Na 32bitovém systému [source,console] ---- $ git config --global core.editor "'C:/Program Files/Notepad++/notepad++.exe' -multiInst -nosession" ---- Na 64bitovém systému [source,console] ---- $ git config --global core.editor "'C:/Program Files (x86)/Notepad++/notepad++.exe' -multiInst -nosession" ----

source: On the ACL file you looked at earlier, this `get_acl_access_data` method returns a data structure that looks like this:
cs: V kombinaci se souborem ACL, který jsme si ukázali před chvílí, poskytne tato metoda `get_acl_access_data` datovou strukturu v této podobě:

source: On the command line, you can pull down several branches like so:
cs: Několik větví můžete přímo z příkazového řádku stáhnout například takto:

source: Once you’re satisfied with your changes, run
cs: Jakmile jste s vašimi změnami spokojeni, spusťte

source: One caveat is that it expects you to be running locally as the same user you push as to the remote machine.
cs: Je však třeba upozornit, že skript očekává, že lokálně pracujete v roli stejného uživatele jako odesíláte data na vzdálený server.

source: One central hub, or repository, can accept code, and everyone synchronizes their work to it.
cs: Jedno centrální úložiště (hub) nebo repozitář přijímá zdrojový kód a každý podle něj synchronizuje svou práci.

source: One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message.
cs: Jeden z běžných důvodů pro vracení úprav nastane, když zapíšete revizi příliš brzy a například jste zapomněli přidat některé soubory, nebo jste něco popletli ve zprávě k revizi.

source: One of the great things about Git is that it allows you to make decisions at the last possible moment.
cs: Jednou ze skvělých možností, které vám Git nabízí, jsou rozhodnutí na poslední chvíli.

source: One of the interesting features of this is that you can ask it to figure out all sorts of code movement as well.
cs: Zajímavou funkcí je také to, že můžete systému Git zadat, aby zjistil všechny druhy přesouvání kódu.

source: One of the main advantages of this approach is that you can continue to work, and the maintainer of the main repository can pull in your changes at any time.
cs: Jednou z hlavních výhod tohoto přístupu je, že můžete pracovat bez přerušení a správce hlavního repozitáře může vaše změny do projektu vtáhnout (pull in) až to uzná za vhodné.

source: One of the main aims of this new edition is to touch on all of those new frontiers in the Git community.
cs: Jedním z hlavních cílů nového vydání je zmínka o všech těchto nových oblastech zájmu v komunitě Git.

source: One of the more helpful options is `-p`, which shows the difference introduced in each commit.
cs: Jednou z užitečnějších voleb je `-p`, která zobrazí rozdíly (diff) provedené v každé revizi.

source: One of the more popular VCS tools was a system called RCS, which is still distributed with many computers today.
cs: Jedním z oblíbených nástrojů pro správu verzí byl systém zvaný RCS, který je ještě dnes distribuován s mnohými počítači.

source: One of the most complicated aspects of setting up a Git server is user management.
cs: Jedním z nejsložitějších aspektů nastavení serveru Git je totiž správa uživatelů.

source: One of the workarounds to the `denyNonFastForwards` policy is for the user to delete the branch and then push it back up with the new reference.
cs: Jednou z možností, jak může uživatel obejít pravidlo `denyNonFastForwards`, je odstranit větev a odeslat ji zpět s novou referencí.

source: One point of view on this is that your repository's commit history is a *record of what actually happened.* It's a historical document, valuable in its own right, and shouldn't be tampered with.
cs: Jeden pohled na věc považuje historii zápisů do repozitáře za *záznam toho, co se skutečně stalo*. Je to historický dokument, který je cenný sám o sobě, a neměli bychom s ním manipulovat.

source: One way is to use the `git fsck` utility, which checks your database for integrity.
cs: Jednou z možností je použít nástroj `git fsck`, který zkontroluje integritu vaší databáze.

source: Options include oneline, short, full, fuller, and format (where you specify your own format).
cs: Parametry příkazu jsou `oneline`, `short`, `full`, `fuller` a `format` (ve kterém uvedete svůj vlastní formát).

source: Or you can do this:
cs: Nebo můžete provést následující:

source: Or you can have Git try to automatically fix the issue before applying the patch:
cs: Git se může také pokusit automaticky daný problém vyřešit, ještě než bude záplata aplikována:

source: Or you could do it manually with a `git fetch` followed by a `git rebase teamone/master` in this case.
cs: Nebo to v tomto případě můžete provést ručně příkazem `git fetch`, následovaným příkazem `git rebase teamone/master`.

source: Or, to compare what is in your `rack` subdirectory with what the `master` branch on the server was the last time you fetched, you can run
cs: Popřípadě chcete-li porovnat, co je ve vašem podadresáři `rack`, s tím, co bylo ve větvi `master` na serveru v okamžiku, kdy jste naposledy vyzvedávali data, spusťte příkaz:

source: Or, you can do something like this:
cs: Provést můžete také tento příkaz:

source: Otherwise the rebase won't be able to tell that it's a duplicate and will add another C4-like patch (which will probably fail to apply cleanly, since the changes would already be at least somewhat there).
cs: V opačném případě nebude příkaz `rebase` schopen zjistit, že se jedná o duplikát, a přidá další záplatu, která se podobá té z C4 (kterou se ale pravděpodobně nepodaří čistě aplikovat, protože tam budou alespoň nějaké změny).

source: Otherwise, it will start from the beginning and will unnecessarily take longer.
cs: Bez této konkretizace začne proces od začátku a bude trvat zbytečně dlouho.

source: Passing `-p` to it instructs the `cat-file` command to figure out the type of content and display it nicely for you:
cs: Přidáte-li k příkazu `cat-file` parametr `-p`, říkáte mu, aby zjistil typ obsahu a přehledně vám ho zobrazil:

source: Paul's master branch is now accessible locally as `pb/master` – you can merge it into one of your branches, or you can check out a local branch at that point if you want to inspect it.
cs: Paulova hlavní větev je teď lokálně dostupná jako `pb/master`. Můžete ji začlenit (merge) do některé ze svých větví, nebo ji můžete zpřístupnit jako lokální větev (check out), jestliže si ji chcete prohlédnout.

source: Perhaps it’s a library that a third party developed or that you’re developing separately and using in multiple parent projects.
cs: Jedná se třeba o knihovnu, kterou vyvinula třetí strana, nebo kterou vyvíjíte odděleně a používáte ji v několika nadřazených projektech.

source: Perhaps you accidentally committed a file that contained a password, and you want to make your project open source.
cs: Nebo jste omylem zapsali soubor obsahující vaše heslo, ale chcete, aby byl váš projekt veřejný.

source: Pro Git ======= :doctype: book :docinfo: :toc: :toclevels: 2
cs: Pro Git ======= :lang: cs :doctype: book :docinfo: :toc: :toclevels: 2

source: Pro Git ======= :doctype: book :docinfo: :toc: :toclevels: 2 :front-cover-image: image:book/cover.png[width=1050,height=1600]
cs: Pro Git ======= :lang: cs :doctype: book :docinfo: :toc: :toclevels: 2 :front-cover-image: image:book/cover.png[width=1050,height=1600]

source: Put the following line in your `.gitattributes` file:
cs: Do souboru `.gitattributes` vložte následující řádek:

source: RCS works by keeping patch sets (that is, the differences between files) in a special format on disk; it can then re-create what any file looked like at any point in time by adding up all the patches.
cs: RCS je založen na uchovávání sad záplat (tj. rozdílů mezi podobami souborů), uložených na disku ve speciálním formátu. Poskládáním záplat může později znovu získat podobu libovolného souboru v libovolném čase.

source: Rebasing replays changes from one line of work onto another in the order they were introduced, whereas merging takes the endpoints and merges them together.
cs: Přeskládání provede změny z jedné řady prací na jinou, a to v pořadí, v jakém byly provedeny. Naproti tomu sloučení vezme koncové body větví a sloučí je dohromady.

source: Regular developers work on their topic branch and rebase their work on top of `master`.
cs: Stálí vývojáři pracují na svých tématických větvích a přeskládávají (rebase) svou práci na vrchol větve `master`.

source: Remember that anything that is still unstaged – any files you have created or modified that you haven't run `git add` on since you edited them – won't go into this commit.
cs: Nezapomeňte, že všechno, co dosud nebylo připraveno k zapsání -- všechny soubory, které jste vytvořili nebo změnili a pro které jste potom nepoužili `git add` --, nebudou do revize zahrnuty.

source: Remember that each file in your working directory can be in one of two states: tracked or untracked.
cs: Zapamatujte si, že každý soubor ve vašem pracovním adresáři může být v jednou ze dvou stavů: sledován (tracked) a nesledován (untracked).

source: Remember that the commit records the snapshot you set up in your staging area.
cs: Nezapomeňte, že příkaz `commit` zaznamená snímek projektu, jak byl obsažen v oblasti připravených změn.

source: Remember, anything that is _committed_ in Git can almost always be recovered.
cs: Zapamatujte si, že vše, co je v Gitu _zapsáno_, lze téměř vždy obnovit.

source: Remote repositories are versions of your project that are hosted on the Internet or network somewhere.
cs: Vzdálené repozitáře jsou verze vašeho projektu umístěné na Internetu nebo kdekoli v síti.

source: Remote-tracking branches act as bookmarks to remind you where the branches in your remote repositories were the last time you connected to them.
cs: Vzdáleně sledované větve fungují jako záložky, které vám připomínají, kde byly větve ve vzdálených repozitářích v době, kdy jste se k nim naposledy připojili.

source: Remote-tracking branches are references to the state of remote branches.
cs: Vzdáleně sledované větve (remote-tracking branches) jsou reference na stav vzdálených větví.

source: Right below the ``Changes to be committed'' text, it says use `git reset HEAD <file>...` to unstage.
cs: Přímo pod textem „Changes to be committed“ („Změny k zapsání“) se říká: „pro odstranění z oblasti připravených změn použijte příkaz `git reset HEAD <soubor>...`“

source: Run `git difftool --tool-help` to see what is available on your system.
cs: Pokud chcete vědět, co je pro váš systém k dispozici, spusťte `git difftool --tool-help`.

source: Run `git push (remote) (branch)`:(((git commands, push)))
cs: Spusťte `git push (vzdálený) (větev)`:(((git příkazy, push)))

source: Running `git pull` generally fetches data from the server you originally cloned from and automatically tries to merge it into the code you're currently working on.
cs: Příkaz `git pull` většinou vyzvedne (fetch) data ze serveru, z něhož jste původně klonovali, a automaticky se pokusí začlenit je (merge) do kódu, na němž právě pracujete.

source: Running `git svn rebase` every once in a while makes sure your code is always up to date.
cs: Spustíte-li čas od času příkaz `git svn rebase`, budete mít jistotu, že pracujete s aktuálním kódem.

source: Running a Git server is fairly straightforward.
cs: Zprovoznění gitového serveru je celkem jednoduché.

source: Running this command gives you a list of commits in your text editor that looks something like this:
cs: Spuštěním tohoto příkazu otevřete textový editor se seznamem revizí zhruba v této podobě:

source: Running your own server gives you a lot of control and allows you to run the server within your own firewall, but such a server generally requires a fair amount of your time to set up and maintain.
cs: Provoz vlastního serveru vám dává celou řadu možností řízení a umožňuje provozovat server za vaším firewallem. Nastavení a správa takového serveru však obecně bývají časově náročné.

source: Say John and Jessica both start working at the same time.
cs: Dejme tomu, že John i Jessica začnou pracovat ve stejném čase.

source: Second, it only shows you commits that have been committed up to the Subversion server.
cs: Zadruhé pak to, že zobrazuje pouze revize, jež byly zapsány na server Subversion.

source: See <<_git_branching>> for more detailed information on how to push to remote servers.
cs: Více informací o odesílání na vzdálené servery najdete v kapitole <<_git_branching>>.

source: See <<_refspec>> for a more detailed discussion of Git refspecs and different things you can do with them.
cs: Podrobnější diskusi o specifikaci gitových referencí a o různých možnostech práce s nimi najdete v kapitole <<_refspec>>.

source: Set up a merge wrapper script named `extMerge` that calls your binary with all the arguments provided:
cs: Nastavte wrapperový skript pro slučování `extMerge`, který bude volat binární soubor všemi dostupnými parametry:

source: Set your key ID like so:
cs: ID svého klíče nastavíte takto:

source: Setting up a `.gitignore` file before you get going is generally a good idea so you don't accidentally commit files that you really don't want in your Git repository.
cs: Většinou je dobré, když soubor `.gitignore` vytvoříte a naplníte ještě dříve, než se pustíte do práce. Díky tomu se vám nestane, že byste nedopatřením zapsali také soubory, o které v gitovém repozitáři nestojíte.

source: She can do so by specifying the local branch followed by a colon (:) followed by the remote branch to the `git push` command:
cs: Může tak učinit příkazem `git push` s určením lokální větve, za níž bude následovat dvojtečka (:) a za ní vzdálená větev:

source: She can merge either `origin/master` or `issue54` first – they're both upstream, so the order doesn't matter.
cs: Buď může nejdříve začlenit `origin/master` nebo `issue54`. Obě revize jsou následníky té aktuální, takže na pořadí nezáleží.

source: She can then fetch Josie's changes down with `git fetch`:
cs: Změny, které Josie provedla, vyzvedne příkazem `git fetch`:

source: She chooses to merge in `issue54` first:
cs: Jessica se rozhodne začlenit nejdříve `issue54`:

source: She creates a new branch for the feature and does some work on it there:
cs: Vytvoří si pro něj novou větev a udělá v ní kus práce:

source: She hasn't fetched John's changes yet, so her commit history looks like this:
cs: Zatím ještě nevyzvedla Johnovy změny, takže její historie revizí vypadá nějak takto:

source: She is told that she's trying to push non-fast-forward changes and that she won't be able to do so until she fetches and merges.
cs: Řekne jí, že se pokouší odeslat změny (push), které nemají charakter „rychle vpřed“, a že to nebude moci udělat, dokud neprovede vyzvednutí a sloučení (fetch a merge).

source: She runs `git log` to find out:
cs: Spustí proto příkaz `git log`:

source: She runs a `git fetch` to pull down those changes:
cs: Jessica je stáhne spuštěním příkazu `git fetch`:

source: She's created a topic branch called `issue54` and done three commits on that branch.
cs: Vytvořila tématickou větev s názvem `issue54` a zapsala do ní tři revize.

source: She's ready to push up her work, but gets an email from Josie that a branch with some initial work on it was already pushed to the server as `featureBee`.
cs: Je připravena odeslat svou práci, ale dostane e-mail od Josie, že již na server odeslala větev `featureBee`, v níž už je část práce hotová.

source: Simply set up a single repository, and give everyone on your team push access; Git won't let users overwrite each other.
cs: Jednoduše vytvořte repozitář a přidělte všem ze svého týmu oprávnění k odesílání dat. Git uživatelům neumožní, aby se navzájem přepisovali.

source: Since Git is quite excellent at preserving backwards compatibility, any version after 2.0 should work just fine.
cs: A protože Git výborně zachovává zpětnou kompatibilitu, měly by všechny verze novější než 2.0 fungovat stejně dobře.

source: Since its birth in 2005, Git has evolved and matured to be easy to use and yet retain these initial qualities.
cs: Od svého vzniku v roce 2005 se Git vyvinul a vyzrál v snadno použitelný systém, který si dodnes uchovává své prvotní kvality.

source: Since then a lot has changed and yet many important things have not.
cs: Od té doby se objevila řada změn, ale mnoho důležitých věcí zůstalo zachováno.

source: Since then, nearly every open source community has adopted it.
cs: Od té doby jej přijaly téměř všechny Open Source komunity.

source: So for example in that output, the `README` file is modified in the working directory but not yet staged, while the `lib/simplegit.rb` file is modified and staged.
cs: Takže například v uvedeném výstupu byl soubor `README` změněn v pracovním adresáři, ale nebyl zatím připraven k zápisu (staged), zatímco soubor `lib/simplegit.rb` byl změněn a připraven k zápisu.

source: So here we can see that our `iss53` branch is tracking `origin/iss53` and is ``ahead'' by two, meaning that we have two commits locally that are not pushed to the server.
cs: Takže vidíme, že naše větev `iss53` sleduje `origin/iss53` a má „náskok“ (ahead) dva, což znamená, že máme lokálně dva objekty revize, které ještě nebyly odeslány na server.

source: So if you're on the `master` branch and it's tracking `origin/master`, you can say something like `git merge @{u}` instead of `git merge origin/master` if you wish.(((+++@{u}+++)))(((+++@{upstream}+++))) ====
cs: Takže pokud jste na větvi `master` a ta sleduje `origin/master`, pak (pokud chcete) můžete místo `git merge origin/master` napsat `git merge @{u}`.(((+++@{u}+++)))(((+++@{upstream}+++))) ====

source: So instead of the result we see in <<_merge_rebase_work>>, we would end up with something more like <<_rebase_rebase_work>>.
cs: Takže místo výsledku z obrázku <<_merge_rebase_work>>, skončíme s něčím, co odpovídá spíše obrázku <<_rebase_rebase_work>>.

source: So we will expect you to know how to open Terminal in Mac or Command Prompt or Powershell in Windows.
cs: Takže od vás budeme očekávat, že na počítači Mac umíte otevřít Terminál, nebo že ve Windows umíte spustit Příkazový řádek či PowerShell.

source: So what if there was a messy series of merge commits?
cs: Jenže co když se vyskytly nějaké zamuchlané posloupnosti bodů sloučení?

source: So, `git fetch origin` fetches any new work that has been pushed to that server since you cloned (or last fetched from) it.
cs: Takže příkaz `git fetch origin` vyzvedne veškerou novou práci, která byla na uvedený server poslána (push) od okamžiku, kdy jste odtud klonovali (nebo kdy jste odtud naposledy vyzvedávali práci).

source: So, if there is a `master` branch on the server, you can access the log of that branch locally via
cs: Je-li tedy na serveru hlavní větev `master`, lokálně lze získat přístup k jejímu logu některým z příkazů:

source: So, if you see that a method in your code is buggy, you can annotate the file with `git blame` to see when each line of the method was last edited and by whom.
cs: Pokud zjistíte, že některá metoda ve vašem kódu obsahuje chybu, můžete soubor anotovat příkazem `git blame`, který u každého řádku metody zobrazí, kdo a kdy ho naposledy upravil.

source: So, if you send in a patch to a project and one of the core members applies the patch, both of you get credit – you as the author, and the core member as the committer.
cs: Pokud tedy pošlete záplatu k projektu a někdo z užšího týmu footnote:[core member] ji použije, získáte zásluhu oba -- vy, jako autor, i daný člen týmu, jako autor revize.

source: So, if you want to make a single commit from these three commits, you make the script look like this:
cs: Chcete-li tedy vytvořit jedinou revizi z těchto tří revizí, bude skript vypadat takto:

source: So, in the following file
cs: Do souboru

source: So, let's use that advice to unstage the `CONTRIBUTING.md` file:
cs: Budeme se tedy řídit touto radou a z oblasti připravených změn odstraníme soubor `CONTRIBUTING.md`:

source: So, the first thing to do in your `print_export` method is generate a mark from the directory name:
cs: Prvním krokem, který tak při metodě se souborem `print_export` uděláte, bude vygenerování označovače na základě názvu adresáře:

source: So, to create a tree object, you first have to set up an index by staging some files.
cs: Proto chcete-li vytvořit objekt stromu, musíte ze všeho nejdříve připravit soubory k zapsání, a vytvořit tak index.

source: So, what is Git in a nutshell?
cs: Co že to vlastně Git v jádru je?

source: So, you can either run four config commands
cs: Můžete tedy spustit kterýkoli ze čtyř konfiguračních příkazů:

source: Some Linux distributions have a `gitweb` package that you may be able to install via `apt` or `yum`, so you may want to try that first.
cs: Některé linuxové distribuce mají balíček `gitweb`, který by mělo být možné nainstalovat pomocí nástrojů `apt` nebo `yum`. Zkuste proto tuto možnost jako první.

source: Some files look like text files but for all intents and purposes are to be treated as binary data.
cs: Některé soubory se tváří jako textové, ale v podstatě je s nimi třeba zacházet jako s binárními daty.

source: Some larger projects also have a `proposed` or `pu` (proposed updates) branch that has integrated branches that may not be ready to go into the `next` or `master` branch.
cs: Některé větší projekty mají také větev `proposed` nebo `pu` (proposed updates, návrh úprav), která přebírá věci z větví, které nejsou způsobilé k začlenění do větví `next` nebo `master`.

source: Some of the variables involved are active contributor count, chosen workflow, your commit access, and possibly the external contribution method.
cs: Mezi proměnné v tomto procesu patří počet aktivních přispěvatelů, zvolený pracovní postup, vaše oprávnění pro odesílání revizí a případně i metoda externího přispívání.

source: Some people may instead find it useful to install Git from source, because you'll get the most recent version.
cs: Někteří lidé si Git instalují raději ze zdrojových textů, protože tímto způsobem získáte nejnovější verzi.

source: Some people refer to Git's branching model as its ``killer feature,'' and it certainly sets Git apart in the VCS community.
cs: Někteří lidé mluví o modelu větvení Gitu jako o „převratné vlastnosti“ a mezi systémy pro správu verzí se jím Git určitě odlišuje.

source: Someone accidentally commits a huge binary file with a thoughtless `git add .`, and you want to remove it everywhere.
cs: Někdo příkazem `git add .` bezmyšlenkovitě zapsal obří binární soubor a vy ho chcete odstranit ze všech revizí.

source: Splitting a commit undoes a commit and then partially stages and commits as many times as commits you want to end up with.
cs: Rozdělení revize vrátí všechny změny v revizi obsažené a po částech je znovu připraví a zapíše do tolika revizí, kolik určíte jako konečný počet.
